MBronsom/OfflineSWD/STM32-OffineSWD/RL/USB/Drivers/usbd_STM32F2xx_HS.c
  /*PI11 (OTG_HS_ULPI alternate functon, DIR)                                 */
  GPIOI->MODER     =  (GPIOI->MODER  & ~(3  <<  22)) | (2  << 22);
  GPIOI->OSPEEDR  |=  (3  << 22);
  GPIOI->AFR[1]    =  (GPIOI->AFR[1] & ~(15 <<  12)) | (10 << 12);

  /* PH4 (OTG_HS_ULPI alternate function, NXT)                                */
  GPIOH->MODER     =  (GPIOH->MODER  & ~(3  <<   8)) | (2  <<  8);
  GPIOH->OSPEEDR  |=  (3  <<  8);
  GPIOH->AFR[0]    =  (GPIOH->AFR[0] & ~(15 <<  16)) | (10 << 16);

  /* PA5 (OTG_HS_ULPI alternate function, CLOCK)                              */
  GPIOA->MODER     =  (GPIOA->MODER  & ~(3  <<  10)) | (2  << 10);
  GPIOA->OSPEEDR  |=  (3  << 10);
  GPIOA->AFR[0]    =  (GPIOA->AFR[0] & ~(15 <<  20)) | (10 << 20);
#else
  RCC->AHB1ENR    |=  (1 << 1);         /* Enable clock for Port B            */

  /* Configure PB14 and PB15 as alternate OTG_HS_DM and OTG_HS_DP pins        */
  GPIOB->MODER     =  (GPIOB->MODER  & ~(0x0FUL << 28)) | (0x0AUL << 28);
  GPIOB->OTYPER   &= ~(3 << 14);
  GPIOB->AFR[1]    =  (GPIOB->AFR[1] & ~(0xFFUL << 24)) | (0xCCUL << 24);
  GPIOB->OSPEEDR  |=  (15UL << 28);
  GPIOB->PUPDR    &= ~(15UL << 28);
#endif

  RCC->AHB1ENR    |=  (1 << 29);        /* Enable clock for OTG HS            */
  usbd_stm32_delay    (100);            /* Wait ~10 ms                        */
  RCC->AHB1RSTR   |=  (1 << 29);        /* Reset OTG HS clock                 */
  usbd_stm32_delay    (100);            /* Wait ~10 ms                        */
  RCC->AHB1RSTR   &= ~(1 << 29);
  usbd_stm32_delay    (400);            /* Wait ~40 ms                        */
#ifndef __OTG_HS_EMBEDDED_PHY
  RCC->AHB1ENR    |=  (1 << 30);        /* Enable clock for OTG HS ULPI       */
#endif

#ifdef __OTG_HS_EMBEDDED_PHY
  OTG->GUSBCFG    |=  (1 <<  6) ;       /* PHYSEL=1                           */
#endif
  usbd_stm32_delay    (200);            /* Wait ~20 ms                        */
  tout = 1000;                          /* Wait max 1 s for AHBIDL = 0        */
  while (!(OTG->GRSTCTL & (1UL << 31))) {
    if (!tout) break;
    tout --;
    usbd_stm32_delay  (10);             /* Wait 1 ms                          */
  }
  OTG->GRSTCTL    |=  1;                /* reset otg core                     */
  tout = 1000;                          /* Wait max 1 s for CRST = 0          */
  while (OTG->GRSTCTL & (1 << 0)) {
    if (!tout) break;
    tout --;
    usbd_stm32_delay  (10);             /* Wait 1 ms                          */
  }
  usbd_stm32_delay    (30);             /* Wait 3 ms                          */

  OTG->GAHBCFG    &=  ~1;               /* Disable interrupts                 */
  OTG->GCCFG      |=  (1 << 21);        /* No VBUS sensing                    */
  OTG->DCTL       |=  (1 <<  1);        /* soft disconnect enabled            */

  OTG->GUSBCFG    |=  (1 << 30);        /* Force device mode                  */
  usbd_stm32_delay    (1000);           /* Wait min 25 ms, we wait ~100 ms    */

#ifndef __OTG_HS_EMBEDDED_PHY
  OTG->DCFG       &= ~3;                /* High speed phy                     */
#else
  OTG->DCFG       |=  3;                /* Full speed phy                     */
#endif

  OTG->GINTMSK     = (1   << 11) |      /* suspend int unmask                 */
                     (1   << 12) |      /* reset int unmask                   */
                     (1   << 13) |      /* enumeration done int unmask        */
                     (1   << 4 ) |      /* receive fifo non-empty int  unmask */
                     (1   << 18) |      /* IN EP int unmask                   */
                     (1   << 19) |      /* OUT EP int unmask                  */
                     (1UL << 31) |      /* resume int unmask                  */
#ifdef __RTX
  ((USBD_RTX_DevTask   != 0) ? (1 <<  3) : 0);   /* SOF int unmask            */
#else
  ((USBD_P_SOF_Event   != 0) ? (1 <<  3) : 0);   /* SOF int unmask            */
#endif

  USBD_IntrEna();                       /* Enable OTG interrupt               */
  OTG->GAHBCFG    |=  1 | (1 << 7);     /* Enable interrupts                  */
}


/*
 *  USB Device Connect Function
 *   Called by the User to Connect/Disconnect USB Device
 *    Parameters:      con:   Connect/Disconnect
 *    Return Value:    None
 */

void USBD_Connect (uint32_t con) {
  if (con) {
#ifdef __OTG_HS_EMBEDDED_PHY
    OTG->GCCFG  |=  (1 << 16);          /* power down deactivated             */
#endif
    OTG->DCTL   &= ~(1 <<  1);          /* soft disconnect disabled           */
  }
  else {
    OTG->DCTL   |=  (1 <<  1);          /* soft disconnect enabled            */
#ifdef __OTG_HS_EMBEDDED_PHY
    OTG->GCCFG  &= ~(1 << 16);          /* power down activated               */
#endif
  }
}


/*
 *  USB Device Reset Function
 *   Called automatically on USB Device Reset
 *    Return Value:    None
 */

void USBD_Reset (void) {
  uint32_t i;

  SyncWriteEP       = 0;
  InPacketDataReady = 0;
  OTG->DOEPMSK      = 0;
  OTG->DIEPMSK      = 0;  
  
  for (i = 0; i < (USBD_EP_NUM + 1); i++) {
    if (DOEPCTL(i) & (1UL << 31)) {
      DOEPCTL(i)  = (1 << 30) | (1 << 27);   /* OUT EP disable, Set NAK       */
    }
    if (DIEPCTL(i) & (1UL << 31))
      DIEPCTL(i)  = (1 << 30) | (1 << 27);   /* IN EP disable, Set NAK        */
    
    DIEPINT(i)    = 0x1B;                    /* clear IN Ep interrupts        */
    DOEPINT(i)    = 0x1B;                    /* clear OUT Ep interrupts       */
  }

  USBD_SetAddress(0 , 1);

  OTG->DAINTMSK  = (1 << 16) |          /* unmask IN&OUT EP0 interruts        */
                    1;
  OTG->DOEPMSK   = (1 << 3) |           /* setup phase done                   */
                   (1 << 1) |           /* endpoint disabled                  */
                    1;                  /* transfer complete                  */
  OTG->DIEPMSK   = (1 << 1) |           /* endpoint disabled                  */
                    1;                  /* transfer completed                 */

  OTG->GRXFSIZ   =  RX_FIFO_SIZE/4;
  OTG->TX0FSIZ   = (RX_FIFO_SIZE/4) | ((TX0_FIFO_SIZE/4) << 16);

  OTG->DIEPTXF1  = ((RX_FIFO_SIZE + TX0_FIFO_SIZE)/4) |
                   ((TX1_FIFO_SIZE/4) << 16);

